/**********************************************************************************************************
 * 文件名: dev_queue.c
 * 概  述: 设备队列管理
 * 创建时间: 2025-08-01
 * 更新时间: 2025-08-22
 * 作  者: LYJ
 * 版  本: 1.0.0
 * Copyright (c) 2025, Mr.Liu All rights reserved.
 **********************************************************************************************************/
#include "./core/dev_queue.h"
#include "./core/dev_malloc.h"


/*************************************************************
 * 函数名：Dev_Queue_Clear
 * 功  能：设备清空队列
 * 形  参：@param: *q -> 队列指针
 * 返  回：无
 * 调  用：外部调用
**************************************************************/
void Dev_Queue_Clear(Dev_Queue_t *q)
{
    q->head = NULL;
    q->tail = NULL;
}

/*************************************************************
 * 函数名：Dev_Get_Queue_Idle
 * 功  能：设备获取队列空闲索引
 * 形  参：@param: *q -> 队列指针
 *         @param: *data -> 数据指针
 *         @param: size -> 数据大小
 * 返  回：@retval: 队列空闲索引
 * 调  用：外部调用
**************************************************************/
uint16_t Dev_Get_Queue_Idle(Dev_Queue_t *q)
{
    return (q->count < q->depth) ? q->tail : 0xFFFF;
}

/*************************************************************
 * 函数名：Dev_Get_Queue_Occupied
 * 功  能：设备获取队列占用索引
 * 形  参：@param: *queue -> 队列指针
 * 返  回：@retval: 队列占用索引
 * 调  用：外部调用
**************************************************************/
uint16_t Dev_Get_Queue_Occupied(Dev_Queue_t *q)
{
    return q->count ? q->head : QUEUE_INVALID_IDX;
}

/*************************************************************
 * 函数名：Dev_Get_Queue_FreeCount
 * 功  能：设备获取队列剩余可入队条数
 * 形  参：@param: *queue -> 队列指针
 * 返  回：@retval: 队列剩余可入队条数
 * 调  用：外部调用
**************************************************************/
uint16_t Dev_Get_Queue_FreeCount(Dev_Queue_t *q)
{
    if(!q || q->count >= q->depth)
        return 0;
    return (uint16_t)(q->depth - q->count);
}

/*************************************************************
 * 函数名：Dev_Queue_Push
 * 功  能：设备队列入队
 * 形  参：@param: *queue -> 队列指针
 * 返  回：无
 * 调  用：外部调用
**************************************************************/
void Dev_Queue_Push(Dev_Queue_t *q)
{
    if(q->count < q->depth)
    {
        q->tail = (++q->tail) % q->depth;   // 环形缓冲区处理
        q->count++;
    }
}

/*************************************************************
 * 函数名：Dev_Queue_Pop
 * 功  能：设备队列出队
 * 形  参：@param: *queue -> 队列指针
 * 返  回：无
 * 调  用：外部调用
**************************************************************/
void Dev_Queue_Pop(Dev_Queue_t *q)
{
    if(q->count)   // 队列空
    {
        q->head = (++q->head) % q->depth;
        q->count--;
    }
}

