/**********************************************************************************************************
 * 文件名: spi_app.c
 * 概  述: SPI协议应用
 * 创建时间: 2025-08-01
 * 更新时间: 2025-08-22
 * 作  者: LYJ
 * 版  本: 1.0.0
 * Copyright (c) 2025, Mr.Liu All rights reserved.
 **********************************************************************************************************/
/********************************** SPI数据传输协议（无ACK） **************************
 * 数据格式: （帧头 + 数据长度（2字节） + 数据 + CRC校验（2字节） + 帧尾）* n
*************************************************************************************/
/********************************** SPI数据传输协议（ACK） ****************************
 * 数据格式: 帧头 + 数据长度（2字节） + 数据 + CRC校验（2字节） + 帧尾
 * 应答格式：
 *     传输成功 -> 帧头 + CRC校验（2字节） + 帧尾
 *     传输失败 -> 帧头 + 0xFFFF（2字节） + 帧尾
*************************************************************************************/
#include "./spi/spi_app.h"


//! --------------------- ↓ 自定义头文件 ↓ --------------------- !//
#include "spi.h"
//! --------------------- ↑ 自定义头文件 ↑ --------------------- !//


//! ---------------------- ↓ 自定义变量 ↓ ---------------------- !//
extern Spi_Device_t *esp32c6_dh;
//! ---------------------- ↑ 自定义变量 ↑ ---------------------- !//


/********************************************************************************************
* 函数名：Spi_Resolve_Handle
* 描  述：SPI 数据解析处理
* 输  入：@param: id -> 设备描述符
*         @param: *rdata -> 数据指针
*         @param: size -> 数据大小
* 输  出：无
* 调  用：外部调用
********************************************************************************************/
void Spi_Resolve_Handle(uint16_t id, uint8_t *rdata, uint16_t size)
{
    //! 设备数据解析（自定义）
    if(id == esp32c6_dh->id)
    {
//        for(uint16_t i = 0;i < size;i++)
//            DEV_PRINTF("%c", rdata[i]);
//        DEV_PRINTF("\r\n");
    }
    else
        DEV_PRINTF("未解析设备描述符：%d！\r\n", id);
}

/********************************************************************************************
* 函数名：Spi_Send_Err_Handle
* 描  述：SPI 指令发送失败处理
* 输  入：@param: id -> 设备描述符
*         @param: *sdata -> 数据指针
*         @param: size -> 数据大小
* 输  出：无
* 调  用：外部调用
********************************************************************************************/
void Spi_Send_Err_Handle(uint16_t id, uint8_t *sdata, uint16_t size)
{
    //! 设备数据发送失败处理（自定义）
    if(id == esp32c6_dh->id)
    {
        DEV_PRINTF("TX -> FAIL -> ");
        for(uint16_t i = 0;i < size;i++)
            DEV_PRINTF("%c", sdata[i]);
        DEV_PRINTF("\r\n");
    }
    else
        DEV_PRINTF("未解析设备描述符：%d！\r\n", id);
}


//! ---------------------- ↓ 自定义函数 ↓ ---------------------- !//
/********************************************************************************************
* 函数名：Spi_Send_SN
* 描  述：SPI 发送序列号
* 输  入：无
* 输  出：无
* 调  用：外部调用
********************************************************************************************/
// void Spi_Send_SN(void)
// {
//     uint8_t SN[12] = "1904CCM0101";
//     Spi_TxQueue_Push(esp32c6_dh, SN, sizeof(SN));
// }
//! ---------------------- ↑ 自定义函数 ↑ ---------------------- !//




