/**********************************************************************************************************
 * 文件名: spi_bsp.h
 * 概  述: SPI协议底层接口
 * 创建时间: 2025-08-01
 * 更新时间: 2025-08-22
 * 作  者: LYJ
 * 版  本: 1.0.0
 * Copyright (c) 2025, Mr.Liu All rights reserved.
 **********************************************************************************************************/
#pragma once
#ifdef __cplusplus
extern "C" {
#endif

#include "./spi/spi_config.h"


//! ---------------- ↓ 自定义头文件 ↓ ---------------- !//

//! ---------------- ↑ 自定义头文件 ↑ ---------------- !//


//! ---------------- ↓ SPI 参数配置 ↓ ---------------- !//

//! ---------------- ↑ SPI 参数配置 ↑ ---------------- !//


//! ----------------- ↓ 自定义变量 ↓ ----------------- !//

//! ----------------- ↑ 自定义变量 ↑ ----------------- !//


//! ----------------- ↓ 自定义函数 ↓ ----------------- !//
extern bool Ph_Spi1_Init(void);
extern void Ph_Spi1_DeInit(void);
extern bool Spi1_TxRx_Data(uint8_t *sdata, uint8_t *rdata, uint16_t len);
extern void Esp32c6_Spi_Cs_Enable(void);
extern void Esp32c6_Spi_Cs_Disable(void);
//! ----------------- ↑ 自定义函数 ↑ ----------------- !//


extern void Spi_Device_Init(void);


#ifdef __cplusplus
}
#endif
